import styles from "./Services.module.css";
import { Service } from "./Service/Service";

const services = [
  {
    name: "Сватбена <br> Флористика",
    text: "Сватбената украса е сърцето на всяка незабравима сватба – тя създава атмосферата, подчертава стила и прави всеки момент още по-вълшебен. Нашата сватбена декорация се отличава с внимание към детайла, персонализиран подход и безупречен вкус. Всяка аранжировка, всеки елемент е създаден с любов и вдъхновение, за да отрази вашата уникална история. Затова вярваме, че нашата украса не просто краси пространството – тя разказва вашата приказка по най-красивия възможен начин.",
    image: "/hero.png",
    link: "#",
  },
  {
    name: "Украса За<br> Рожден Ден",
    text: "Сватбената украса е сърцето на всяка незабравима сватба – тя създава атмосферата, подчертава стила и прави всеки момент още по-вълшебен. Нашата сватбена декорация се отличава с внимание към детайла, персонализиран подход и безупречен вкус. Всяка аранжировка, всеки елемент е създаден с любов и вдъхновение, за да отрази вашата уникална история. Затова вярваме, че нашата украса не просто краси пространството – тя разказва вашата приказка по най-красивия възможен начин.",
    image: "/hero.png",
    link: "#",
  },
  {
    name: "Моминско <br> Парти",
    text: "Сватбената украса е сърцето на всяка незабравима сватба – тя създава атмосферата, подчертава стила и прави всеки момент още по-вълшебен. Нашата сватбена декорация се отличава с внимание към детайла, персонализиран подход и безупречен вкус. Всяка аранжировка, всеки елемент е създаден с любов и вдъхновение, за да отрази вашата уникална история. Затова вярваме, че нашата украса не просто краси пространството – тя разказва вашата приказка по най-красивия възможен начин.",
    image: "/hero.png",
    link: "#",
  },
  {
    name: " Плажен <br> Пикник",
    text: "Сватбената украса е сърцето на всяка незабравима сватба – тя създава атмосферата, подчертава стила и прави всеки момент още по-вълшебен. Нашата сватбена декорация се отличава с внимание към детайла, персонализиран подход и безупречен вкус. Всяка аранжировка, всеки елемент е създаден с любов и вдъхновение, за да отрази вашата уникална история. Затова вярваме, че нашата украса не просто краси пространството – тя разказва вашата приказка по най-красивия възможен начин.",
    image: "/hero.png",
    link: "#",
  },
  {
    name: "Ергенско <br> Парти",
    text: "Сватбената украса е сърцето на всяка незабравима сватба – тя създава атмосферата, подчертава стила и прави всеки момент още по-вълшебен. Нашата сватбена декорация се отличава с внимание към детайла, персонализиран подход и безупречен вкус. Всяка аранжировка, всеки елемент е създаден с любов и вдъхновение, за да отрази вашата уникална история. Затова вярваме, че нашата украса не просто краси пространството – тя разказва вашата приказка по най-красивия възможен начин.",
    image: "/hero.png",
    link: "#",
  },
];

export default function Services() {
  return (
    <section className={styles.serviceSct}>
      <ul className={styles.serviceUl}>
        {services.map((service) => (
          <Service
            name={service.name}
            text={service.text}
            image={service.image}
            link={service.link}
            key={service.name}
          />
        ))}
      </ul>
    </section>
  );
}
