import styles from "./ServicesSct.module.css";
import Button from "@/components/Button";
import Link from "next/link";

const services = [
  {
    name: "Сватбена <br> Флористика",
    text: "Сватбената украса е сърцето на всяка незабравима сватба – тя създава атмосферата, подчертава стила и прави всеки момент още по-вълшебен. Нашата сватбена декорация се отличава с внимание към детайла, персонализиран подход и безупречен вкус. Всяка аранжировка, всеки елемент е създаден с любов и вдъхновение, за да отрази вашата уникална история. Затова вярваме, че нашата украса не просто краси пространството – тя разказва вашата приказка по най-красивия възможен начин.",
    image: "/hero.png",
    link: "#",
  },
  {
    name: "Украса За<br> Рожден Ден",
    text: "Сватбената украса е сърцето на всяка незабравима сватба – тя създава атмосферата, подчертава стила и прави всеки момент още по-вълшебен. Нашата сватбена декорация се отличава с внимание към детайла, персонализиран подход и безупречен вкус. Всяка аранжировка, всеки елемент е създаден с любов и вдъхновение, за да отрази вашата уникална история. Затова вярваме, че нашата украса не просто краси пространството – тя разказва вашата приказка по най-красивия възможен начин.",
    image: "/hero.png",
    link: "#",
  },
  {
    name: "Моминско <br> Парти",
    text: "Сватбената украса е сърцето на всяка незабравима сватба – тя създава атмосферата, подчертава стила и прави всеки момент още по-вълшебен. Нашата сватбена декорация се отличава с внимание към детайла, персонализиран подход и безупречен вкус. Всяка аранжировка, всеки елемент е създаден с любов и вдъхновение, за да отрази вашата уникална история. Затова вярваме, че нашата украса не просто краси пространството – тя разказва вашата приказка по най-красивия възможен начин.",
    image: "/hero.png",
    link: "#",
  },
  {
    name: " Плажен <br> Пикник",
    text: "Сватбената украса е сърцето на всяка незабравима сватба – тя създава атмосферата, подчертава стила и прави всеки момент още по-вълшебен. Нашата сватбена декорация се отличава с внимание към детайла, персонализиран подход и безупречен вкус. Всяка аранжировка, всеки елемент е създаден с любов и вдъхновение, за да отрази вашата уникална история. Затова вярваме, че нашата украса не просто краси пространството – тя разказва вашата приказка по най-красивия възможен начин.",
    image: "/hero.png",
    link: "#",
  },
  {
    name: "Ергенско <br> Парти",
    text: "Сватбената украса е сърцето на всяка незабравима сватба – тя създава атмосферата, подчертава стила и прави всеки момент още по-вълшебен. Нашата сватбена декорация се отличава с внимание към детайла, персонализиран подход и безупречен вкус. Всяка аранжировка, всеки елемент е създаден с любов и вдъхновение, за да отрази вашата уникална история. Затова вярваме, че нашата украса не просто краси пространството – тя разказва вашата приказка по най-красивия възможен начин.",
    image: "/hero.png",
    link: "#",
  },
];

export default function ServicesSct() {
  return (
    <section className={styles.serviceSct}>
      <ul className={styles.serviceUl}>
        {services.map((service) => (
          <ServiceCont
            name={service.name}
            text={service.text}
            image={service.image}
            link={service.link}
            key={service.name}
          />
        ))}
      </ul>
    </section>
  );
}

function ServiceCont({ name, text, image, link, key }) {
  return (
    <li className={styles.serviceLi}>
      <div className={styles.imgDiv}>
        <img src={image} alt={name} />
      </div>
      <div className={styles.contentDiv}>
        <h2 dangerouslySetInnerHTML={{ __html: name }} />
        <p>{text}</p>
        <Link href={link}>
          <Button className="btn orange-btn">
            <span>Резервирай сега</span>
          </Button>
        </Link>
      </div>
    </li>
  );
}
