import styles from "./Services.module.css";
import { Service } from "./Service";

const services = [
  {
    name: "Сватбена <br> Флористика",
    text: "Сватбенате цветя са сърцето на всяка незабравима сватба – те създават атмосферата, подчертават стила и правят всеки момент още по-вълшебен. Нашите сватбени аранжировки се отличават с внимание към детайла, персонализиран подход и безупречен вкус. Всяка аранжировка, всеки елемент е създаден с любов и вдъхновение, за да отрази вашата уникална история. Затова вярваме, че нашите цветя не просто красят пространството – те разказват вашата приказка по най-красивия възможен начин.",
    image: "/services_wedding.jpg",
  },
  {
    name: "Рожден Ден/<br> Юбилей",
    text: "Празничната украса за рожден ден или юбилей е много повече от декор – тя е начин да изразите радостта, любовта и благодарността към живота. В Always Blooming Events вярваме, че всеки празник заслужава специално внимание и уникален стил. Нашите инсталации с балони съчетават изтънчен вкус, внимание към детайла и персонално отношение, за да превърнат всеки момент в спомен, който ще се пази завинаги. Независимо дали празнувате кръгъл юбилей или още една прекрасна година, ние сме тук, за да направим вашия ден още по-вълшебен, красив и незабравим.",
    image: "/services_jubilei.jpg",
  },
  {
    name: "Детски <br> Рожден Ден",
    text: "Детският рожден ден е магически момент, изпълнен с усмивки, смях и незабравими емоции. В Always Blooming Events вярваме, че всяко дете заслужава празник като от приказка. Затова създаваме тематични декорации, които превръщат пространството в истинско вълшебство – с балони, цветове и детайли, съобразени с интересите и мечтите на вашето дете. От любимите анимационни герои до приказни светове – ние сме тук, за да направим рождения ден не просто празник, а приключение, което ще се помни завинаги.",
    image: "/services_detski.jpg",
  },
  {
    name: "Моминско <br> Парти",
    text: "Моминското парти е едно от най-специалните преживявания преди големия ден – време за смях, споделени емоции и незабравими моменти с най-близките приятелки. В Always Blooming Events превръщаме това вълнуващо събитие в стилно и вдъхновяващо изживяване. Съчетаваме елегантна декорация, тематични елементи и усещане за лукс, за да създадем атмосфера, в която всяка дама се чувства специална. Независимо дали мечтаете за нежен пикник, шикозна фотозона или вечер на плажа под звездите – ние ще направим вашето моминско парти точно толкова незабравимо, колкото заслужавате.",
    image: "/services_mominsko.jpg",
  },
  {
    name: " Вечери <br> На Плажа",
    text: "Няма нищо по-романтично и отпускащо от пикник на плажа – с шум на вълни, мек пясък и залез, който спира дъха. В Always Blooming Events създаваме стилни и уютни плажни изживявания, които съчетават комфорт, естетика и вдъхновение от природата. От изискано аранжирани масички и възглавници до нежно осветление и внимателно подбрани детайли – всеки наш плажен пикник е проектиран с вкус и внимание към вашите желания. Перфектен за романтични моменти, празници с приятели или специални поводи, които искате да запомните завинаги.",
    image: "/services_beach.jpg",
  },
  {
    name: "Ергенско <br> Парти",
    text: "Ергенското парти е празник на свободата, приятелството и незабравимите моменти преди новото начало. В Always Blooming Events знаем как да превърнем този специален ден (или нощ!) в стилно и запомнящо се приключение. Предлагаме декорация, която пасва на вашия стил – от елегантни и минималистични визии до смели и тематични концепции. Независимо дали планирате градинско парти, вечер с уиски и пури, или нещо по-нестандартно – ние ще се погрижим атмосферата да бъде точно такава, каквато си я представяте. Защото този момент е веднъж в живота – нека бъде легендарен.",
    image: "/services_bachelor.jpg",
  },
  {
    name: "Бал",
    text: "Балът е вечерта, в която мечтите оживяват, а спомените се запечатват завинаги. В Always Blooming Events вярваме, че всяка бална нощ заслужава вълшебна атмосфера и неповторим стил. Създаваме елегантна и модерна декорация, която подчертава индивидуалността на всеки абитуриент и придава класа на събитието. Независимо дали търсите нежен блясък, флорална изтънченост или дръзка визия, ние ще ви помогнем да се почувствате специални в най-важната вечер от ученическите години.",
    image: "/services_prom.jpg",
  },
  {
    name: "Корпоративно <br> Парти",
    text: "Едно добре организирано корпоративно парти създава сплотеност, вдъхновение и незабравими емоции извън работната среда. В Always Blooming Events комбинираме професионализъм с креативност, за да предложим стилна и функционална декорация, съобразена с духа на вашата фирма. От изискани коктейлни вечери до тематични тиймбилдинги – ние се грижим всяко събитие да отразява фирмената идентичност и да оставя приятно впечатление у всеки гост. Защото доброто преживяване е добра инвестиция.",
    image: "/services_korporativno.jpg",
  },
];

export default function Services({ openCta }) {
  return (
    <section className={styles.serviceSct}>
      <ul className={styles.serviceUl}>
        {services.map((service) => (
          <Service
            name={service.name}
            text={service.text}
            image={service.image}
            key={service.name}
            openCta={openCta}
          />
        ))}
      </ul>
    </section>
  );
}
